---
kind: method
id: M:Autodesk.Revit.DB.DoubleParameterValue.#ctor(System.Double)
source: html/f79896dc-aefe-b05f-7995-16fc47d5c58b.htm
---
# Autodesk.Revit.DB.DoubleParameterValue.#ctor Method

Value constructor

## Syntax (C#)
```csharp
public DoubleParameterValue(
	double value
)
```

## Parameters
- **value** (`System.Double`)